# Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

def get_max_int(a, b, c):
    result = max([a, b, c])
    return result

print(get_max_int(5, 2, 52))
